jharoian-mchp/24013_DEV3/firmware/pic32cz_ca90/03_SWODemo/src/packs/PIC32CZ2051CA90208_DFP/component/ac.h
#define AC_WINCTRL_WEN0_Pos                   _UINT32_(0)                                          /* (AC_WINCTRL) Window 0 Mode Enable Position */
#define AC_WINCTRL_WEN0_Msk                   (_UINT32_(0x1) << AC_WINCTRL_WEN0_Pos)               /* (AC_WINCTRL) Window 0 Mode Enable Mask */
#define AC_WINCTRL_WEN0(value)                (AC_WINCTRL_WEN0_Msk & (_UINT32_(value) << AC_WINCTRL_WEN0_Pos)) /* Assigment of value for WEN0 in the AC_WINCTRL register */
#define AC_WINCTRL_WINTSEL0_Pos               _UINT32_(1)                                          /* (AC_WINCTRL) Window 0 Interrupt Selection Position */
#define AC_WINCTRL_WINTSEL0_Msk               (_UINT32_(0x3) << AC_WINCTRL_WINTSEL0_Pos)           /* (AC_WINCTRL) Window 0 Interrupt Selection Mask */
#define AC_WINCTRL_WINTSEL0(value)            (AC_WINCTRL_WINTSEL0_Msk & (_UINT32_(value) << AC_WINCTRL_WINTSEL0_Pos)) /* Assigment of value for WINTSEL0 in the AC_WINCTRL register */
#define   AC_WINCTRL_WINTSEL0_ABOVE_Val       _UINT32_(0x0)                                        /* (AC_WINCTRL) Interrupt on signal above window  */
#define   AC_WINCTRL_WINTSEL0_INSIDE_Val      _UINT32_(0x1)                                        /* (AC_WINCTRL) Interrupt on signal inside window  */
#define   AC_WINCTRL_WINTSEL0_BELOW_Val       _UINT32_(0x2)                                        /* (AC_WINCTRL) Interrupt on signal below window  */
#define   AC_WINCTRL_WINTSEL0_OUTSIDE_Val     _UINT32_(0x3)                                        /* (AC_WINCTRL) Interrupt on signal outside window  */
#define AC_WINCTRL_WINTSEL0_ABOVE             (AC_WINCTRL_WINTSEL0_ABOVE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt on signal above window Position  */
#define AC_WINCTRL_WINTSEL0_INSIDE            (AC_WINCTRL_WINTSEL0_INSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt on signal inside window Position  */
#define AC_WINCTRL_WINTSEL0_BELOW             (AC_WINCTRL_WINTSEL0_BELOW_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt on signal below window Position  */
#define AC_WINCTRL_WINTSEL0_OUTSIDE           (AC_WINCTRL_WINTSEL0_OUTSIDE_Val << AC_WINCTRL_WINTSEL0_Pos) /* (AC_WINCTRL) Interrupt on signal outside window Position  */
#define AC_WINCTRL_Msk                        _UINT32_(0x00000007)                                 /* (AC_WINCTRL) Register Mask  */

#define AC_WINCTRL_WEN_Pos                    _UINT32_(0)                                          /* (AC_WINCTRL Position) Window x Mode Enable */
#define AC_WINCTRL_WEN_Msk                    (_UINT32_(0x1) << AC_WINCTRL_WEN_Pos)                /* (AC_WINCTRL Mask) WEN */
#define AC_WINCTRL_WEN(value)                 (AC_WINCTRL_WEN_Msk & (_UINT32_(value) << AC_WINCTRL_WEN_Pos)) 

/** \brief AC register offsets definitions */
#define AC_CTRLA_REG_OFST              _UINT32_(0x00)      /* (AC_CTRLA) Control A Offset */
#define AC_CTRLB_REG_OFST              _UINT32_(0x04)      /* (AC_CTRLB) Control B Offset */
#define AC_CTRLC_REG_OFST              _UINT32_(0x08)      /* (AC_CTRLC) Control C Offset */
#define AC_EVCTRL_REG_OFST             _UINT32_(0x0C)      /* (AC_EVCTRL) Event Control Offset */
#define AC_INTENCLR_REG_OFST           _UINT32_(0x10)      /* (AC_INTENCLR) Interrupt Enable Clear Offset */
#define AC_INTENSET_REG_OFST           _UINT32_(0x14)      /* (AC_INTENSET) Interrupt Enable Set Offset */
#define AC_INTFLAG_REG_OFST            _UINT32_(0x18)      /* (AC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define AC_STATUSA_REG_OFST            _UINT32_(0x1C)      /* (AC_STATUSA) Status A Offset */
#define AC_STATUSB_REG_OFST            _UINT32_(0x20)      /* (AC_STATUSB) Status B Offset */
#define AC_DBGCTRL_REG_OFST            _UINT32_(0x24)      /* (AC_DBGCTRL) Debug Control Offset */
#define AC_SYNCBUSY_REG_OFST           _UINT32_(0x28)      /* (AC_SYNCBUSY) Synchronization Busy Offset */
#define AC_COMPCTRL_REG_OFST           _UINT32_(0x30)      /* (AC_COMPCTRL) Pair n Comparator Control 0 Offset */
#define AC_COMPCTRL0_REG_OFST          _UINT32_(0x30)      /* (AC_COMPCTRL0) Pair n Comparator Control 0 Offset */
#define AC_COMPCTRL1_REG_OFST          _UINT32_(0x34)      /* (AC_COMPCTRL1) Pair n Comparator Control 0 Offset */
#define AC_DACCTRL_REG_OFST            _UINT32_(0x38)      /* (AC_DACCTRL) Dac Control Offset */
#define AC_WINCTRL_REG_OFST            _UINT32_(0x3C)      /* (AC_WINCTRL) Window Monitor Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief AC register API structure */
typedef struct
{  /* Analog Comparator Controller */
  __IO  uint32_t                       AC_CTRLA;           /**< Offset: 0x00 (R/W  32) Control A */
  __IO  uint32_t                       AC_CTRLB;           /**< Offset: 0x04 (R/W  32) Control B */
  __IO  uint32_t                       AC_CTRLC;           /**< Offset: 0x08 (R/W  32) Control C */
  __IO  uint32_t                       AC_EVCTRL;          /**< Offset: 0x0C (R/W  32) Event Control */
  __IO  uint32_t                       AC_INTENCLR;        /**< Offset: 0x10 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       AC_INTENSET;        /**< Offset: 0x14 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       AC_INTFLAG;         /**< Offset: 0x18 (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       AC_STATUSA;         /**< Offset: 0x1C (R/   32) Status A */
  __I   uint32_t                       AC_STATUSB;         /**< Offset: 0x20 (R/   32) Status B */
  __IO  uint32_t                       AC_DBGCTRL;         /**< Offset: 0x24 (R/W  32) Debug Control */
  __I   uint32_t                       AC_SYNCBUSY;        /**< Offset: 0x28 (R/   32) Synchronization Busy */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       AC_COMPCTRL[2];     /**< Offset: 0x30 (R/W  32) Pair n Comparator Control 0 */
  __IO  uint32_t                       AC_DACCTRL;         /**< Offset: 0x38 (R/W  32) Dac Control */
  __IO  uint32_t                       AC_WINCTRL;         /**< Offset: 0x3C (R/W  32) Window Monitor Control */
} ac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA90_AC_COMPONENT_H_ */
